EDT/УТ/src/Documents/ПоступлениеСопроводительныхДокументов/ПоступлениеСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеСопроводительныхДокументов</name>
  <registerRecords>InformationRegister.СтатусыДвиженияПриложенныхДокументов</registerRecords>
  <attributes>
    <name>ТерминалОбработки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТерминалДоставки</name>
      <type>
        <types>CatalogRef.РегиональныеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>DocumentRef.Рейс</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПалеты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПриложенногоДокумента</name>
      <type>
        <types>CatalogRef.ВидыПриложенныхДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/СтатусыДвиженияПриложенныхДокументов/СтатусыДвиженияПриложенныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДвиженияПриложенныхДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыДвиженияПриложенныхДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПриложенногоДокумента</name>
    <type>
      <types>CatalogRef.ВидыПриложенныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/ПоступлениеСопроводительныхДокументов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанных = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	//ТерминалОбработки = ПараметрыСеанса.ТерминалДоставки;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СтатусыДвиженияПриложенныхДокументов.Записывать = Истина;
	Движения.СтатусыДвиженияПриложенныхДокументов.Очистить();
	
	//СопроводительныеДокументы = Справочники.ВидыПриложенныхДокументов.СопроводительныеДокументы;
	ДокументыПоступилиВТКОтПартнера = Справочники.СтатусыДвиженияПриложенныхДокументов.ДокументыПоступилиВТКОтПартнера;
	
	Для Каждого СтрокаЗаказа Из Заказы Цикл
		Движение = Движения.СтатусыДвиженияПриложенныхДокументов.Добавить();
		Движение.Период = Дата;
		Движение.Регион = ТерминалОбработки;
		Движение.Заказ = СтрокаЗаказа.Заказ;
		Движение.ВидПриложенногоДокумента = СтрокаЗаказа.ВидПриложенногоДокумента;
		Движение.Статус = ДокументыПоступилиВТКОтПартнера;
		Движение.Рейс = СтрокаЗаказа.Рейс;
	КонецЦикла;
	
КонецПроцедуры
